Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/retirement/older_people_and_working/age_equality_in_employment.html.txt.tmx
Source language: en
Languages: ga

source: Age equality in employment
ga: Comhionannas aoise san fhostaíocht

source: The Employment Equality Acts 1998-2015 prohibit discrimination in employment on a number of grounds, including age. It is unlawful to discriminate against anyone in employment on grounds of age
ga: Cuireann na hAchtanna um Chomhionannas Fostaíochta 1998-2015 cosc ar leatrom a dhéanamh i gcúrsaí fostaíochta ar chúinsí faoi leith, aois san áireamh

source: The Acts only apply to persons above the maximum age at which a person is statutorily obliged to attend school (16 currently)
ga: Tá sé neamhdhleathach leatrom a dhéanamh ar dhuine ar chúinse aois

source: However there are a number of exceptions to the general principle of non-discrimination
ga: Tá roinnt eisceachtaí a bhaineann leis an riail ginearálta a chuireann cosc ar leatrom

source: The Acts also provide for positive action on a number of grounds including age
ga: Cuireann na Achtanna síos freisin ar ghníomhú dearfach chúinsí faoi leith, aois san áireamh

source: The Irish Human Rights and Equality Commission
ga: Coimisiún na hÉireann um Chearta an Duine agus Comhionannas

source: The Irish Human Rights and Equality Commission has a general remit to promote equality under the employment equality legislation
ga: Tá dualgas ginearálta ar Coimisiún na hÉireann um Chearta an Duine agus Comhionannas comhionannas a chur chun cinn faoin reachtaíocht a bhaineann le comhionannas fostaíochta agus comhionannas deiseanna

source: In some instances it provides assistance to people who believe they have been discriminated against
ga: Cuireann sé cúnamh ar fáil do dhaoine a chreideann gur déanadh leatrom orthu

source: The Workplace Relations Commission investigates and/or mediates disputes in relation to the implementation of employment equality legislation
ga: Scrúdaíonn an Binse Comhionannais agus/nó déanann sé idirghabháil i gcás easaontais maidir leis an reachtaíocht a chur i bhfeidhm

source: Complaints about age discrimination are investigated by the Equality Tribunal which may order redress or compensation
ga: Is féidir gearán maidir le leatrom aoise a dhéanamh leis an stiúrthóir a dhéanfaidh scrúdú ar an ngearán agus a ordóidh sásamh nó cúiteamh más cuí

source: The Employment Equality Acts 1998-2015 outlaw direct, indirect discrimination and discrimination by association at work and in all aspects of employment on the grounds of gender, civil and family status, sexual orientation, religion, age, disability, race and membership of the Traveller community
ga: Cuireann na hAchtanna um Chomhionannas Fostaíochta 1998-2015 cosc ar leatrom díreach nó indíreach sa láthair oibre agus i gcoinníollacha fostaíochta ar bhonn gnéis, stádas sibhialta agus teaghlaigh, claonadh gnéasach, creideamh, aois, míchumas, cine agus ballraíocht den lucht siúil

source: Discrimination is defined as the treatment of one person in a less favourable way than another person in a comparable situation on any of the grounds specified
ga: Sainmhínítear an leatrom mar chaitheamh le duine amháin ar bhealach níos mífhabhraí ná duine eile i gcúinsí cosúla ar aon cheann de na forais a shainítear

source: It will cover not only current and past discrimination, but also discrimination that may exist in the future or is imputed to a person
ga: Ní hiad an leatrom reatha agus caite amháin a chlúdóidh sé, ach leatrom a d'fhéadfadh tarlú sa todhchaí nó atá curtha i leith duine éigin freisin

source: The Acts outlaw discrimination by:
ga: Tá cosc san Achtanna ar leatrom a dhéanann

source: The Acts also outlaw discrimination in job advertisements
ga: • Aon údarás a smachtaíonn iontráil chuig nó feidhmiú i gceird, i ngairm, nó i slí bheatha

source: Prohibited discrimination relates to equal pay, access to employment, conditions of employment, training or experience, promotion or regrading or classification of posts
ga: Tá cosc ar leatrom i dtaobh teacht ar fhostaíocht, coinníollacha oibre, i dtraenáil nó taithí, ardú céime nó maidir le rangú fostaíochta

source: Conditions of employment do not, in this context, include pensions
ga: Sa chomhthéasc seo níl pinsin san áireamh i gcoinníollacha oibre

source: Indirect discrimination occurs where an apparently neutral provision puts persons of a particular group covered by the Acts at a particular disadvantage and where the provision is not objectively justified by a legitimate aim and the means of achieving the aim are not appropriate and necessary
ga: Leatrom indíreach i.e. tá riachtanas a chuireann i bhfad níos mó daoine de ghrúpa amháin faoi míbhuntáiste ná daoine i ngrúpa eile agus nach bhfuil fáth maith leis i gcoinne an dlí

source: Exclusions from the general prohibition of discrimination on age grounds
ga: Eisceachtaí ón toirmeasc ginearálta ar leatrom ar fhorais aoise

source: Under the Employment Equality Acts 1998–2015 an employer may:
ga: Faoi na hActanna um Chomhionannas Fostaíochta 1998-2015 is féidir le fostóir:

source: • Set a minimum age requirement (not more than 18 years) for potential applicants for a job
ga: • Íos-riachtanas aoise (nach mó ná 18 bliain d'aois) a shocrú i gcomhair iarrthóirí féideartha ar phost

source: • Offer a fixed-term contract to a person over the compulsory retirement age provided it is objectively justified
ga: • Conradh théarma seasta a thairiscint do dhuine atá os cionn na haoise scoir éigeantaigh ar an gcoinníoll go gcosnaítear é ar bhonn tosca oibiachtúla

source: With regard to an occupational benefits scheme, it does not constitute discrimination on age grounds for an employer to:
ga: Maidir le scéim sochair cheirde, ní leatrom ar fhorais aoise é d'fhostóir:

source: • Fix ages for admission to such a scheme or for entitlement to benefits under it
ga: • Aoiseanna a shocrú i gcomhair teacht isteach ina leithéid de scéim nó i gcomhair teidlíochta ar shochair faoin scéim;

source: • Fix different ages for all employees or a category of employees
ga: • Aoiseanna éagsúla a shocrú do gach fostaí nó catagóir fostaithe;

source: • Use, in the context of such a scheme, age criteria in actuarial calculations
ga: • Úsáid a bhaint as critéir aoise i ríomhaireachtaí achtúire i gcomhthéacs a leithéid de scéim, nó

source: • Provide different rates of severance payment for different employees or groups or categories of employees, these rates being based on or taking into account the period between the age of an employee on leaving the employment and his or her compulsory retirement age
ga: • Rátaí éagsúla pá tearbtha a sholáthar d'fhostaithe éagsúla nó grúpaí nó catagóirí fostaithe, na rátaí seo arna mbunú ar, nó ag tógáil san áireamh na tréimhse idir aois fostaí ar fhágáil na fostaíochta agus ar aois a scoir éigeantaigh

source: provided that these measures do not constitute discrimination on the gender grounds
ga: chomh fada is nach mbíonn leatrom ar fhorais inscne i gceist leis seo

source: Positive action to ease the integration into employment of people across all 9 grounds is allowed under the Acts
ga: Tá gníomhú dearfach chun comhtháthú isteach san fhostaíocht a éascú do dhaoine thar na naoi bhforas go léir seo a cheadaítear faoin Achtanna

source: If you feel that you have been discriminated against on the grounds of age (or any of the other grounds), you should first of all raise the issue with the employer or service provider
ga: Má cheapann tú go ndéanadh leatrom ort ar bhonn aoise (nó ar aon bhonn eile) ba cheart duit ar dtús na ceisteanna ar fad a ardú leis an bhfostóir nó le soláthraí na seirbhíse

source: If this proves to be unsatisfactory, you should make a complaint to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Mura n-éiríonn leat aon sásamh a fháil as an bpróiseas seo ba cheart gearán a dhéanamh tríd an fhoirm gearáin shingil ar fáil ar workplacerelations.ie a úsáid

source: Complaints under the Employment Equality Acts 1998–2015 must be brought within 6 months of the last act of discrimination Where to apply
ga: Ba chóir duit do ghearán faoi na hAchtanna um Chomhionannas Fostaíochta 1998-2015 a sheoladh isteach laistigh de 6 mhí ó dháta an leatroim
